PYTHON_STEPS/cases/testJRM2025/sim/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version         2;
    format          ascii;
    class           dictionary;
    object          controlDict;
}

application     buoyantPimpleFoam;

startFrom       startTime;

startTime       latestTime;

stopAt          endTime;

endTime         1000;

deltaT          0.01;

writeControl    timeStep;

writeInterval   100;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.8;

maxAlphaCo      0.8;

maxDeltaT       0.1;

functions
{
    fieldAverage1
    {
        type            fieldAverage;
        libs            ( "libfieldFunctionObjects.so" );
        writeControl    writeTime;
        fields          ( U { mean on ; prime2Mean off ; base time ; } T { mean on ; prime2Mean off ; base time ; } p { mean on ; prime2Mean off ; base time ; } k { mean on ; prime2Mean off ; base time ; } omega { mean on ; prime2Mean off ; base time ; } );
    }
    probes1
    {
        type            probes;
        libs            ( "libsampling.so" );
        writeControl    timeStep;
        writeInterval   1;
        fields          ( U T p k omega );
        probeLocations  ( );
    }
    scalarTransport_CO2
    {
        type            scalarTransport;
        libs            ( "libsolverFunctionObjects.so" );
        field           CO2;
        writeControl    writeTime;
        phase           none;
        D               1.6e-05;
        resetOnStartUp  false;
    }
    residuals
    {
        type            residuals;
        libs            ( "libutilityFunctionObjects.so" );
        writeControl    timeStep;
        writeInterval   1;
        fields          ( U p_rgh h k omega );
    }
}


// ************************************************************************* //
