PYTHON_STEPS/cases/testJRM2025/sim/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}

numberOfSubdomains 3;

method          simple;

simpleCoeffs
{
    n               (3 1 1);
    delta           0.001;
}

distributed     no;

roots           ( );
